[{"id": 1, "prjTitle": "Password Generator" , "prjText": "This password generator uses the inquirer.js package to prompt a user with a series of questions. Each question defines the criteria used to create a randomly generated password. According to a user's input value, the app creates a password string and prints the output to screen. Learn more at the GitHub Repository below.", "prjPhoto": "./assets/Project1.jpg" , "prjUrl": "https://github.com/snovelli1021/Assignment3" },
{"id": 2, "prjTitle": "Team Profile Generator" , "prjText": "The Team Profile Generator uses Object Oriented Programming to create a class of Employee and it's subclasses: Engineer, Intern, and Manager. The input for each team member is ran through a unit test to verify that the input value is accepted. The application runs on the back-end, and has the results printed to a static HTML page. See the GitHub Repository and walkthrough video at the link below.", "prjPhoto": "./assets/Project2.jpg" , "prjUrl": "https://github.com/snovelli1021/Team-Profile-Generator" },
{"id": 3, "prjTitle": "E-commerce Back-end" , "prjText": "This Express App uses a MySql database, Sequelize, and Insomnia to manipulate merchandise data using the CRUD method. Data records are initally seeded on the backend, and then accessed via Insomnia per the appropriate API routes. View the GitHub Repository and walkthrough video at the link below.", "prjPhoto": "./assets/Project3.jpg" , "prjUrl": "https://github.com/snovelli1021/Object-Relational-Mapping" },
{"id": 4, "prjTitle": "Note Taker" , "prjText": "Note Taker is an Express App that features a clean front-end interface that allows a user to add and delete notes from their web browser. The application is deployed live via Heroku and you can find the link and more at the repository below.", "prjPhoto": "./assets/Project4.jpg" , "prjUrl": "https://github.com/snovelli1021/NoteTaker2" },
{"id": 5, "prjTitle": "Tech Blog" , "prjText": "Tech Blog allows a user to create and delete blog posts and add comments as long as they are signed in. First time visitors are prompted to sign up before they can login and view the dashboard. The multiple page application uses Handlebars.js as it's templating engine. Click below to view the repository on Github.", "prjPhoto": "./assets/Project5.jpg" , "prjUrl": "https://github.com/snovelli1021/TechBlog" },
{"id": 6, "prjTitle": "Text Editor" , "prjText": "Text Editor is a Progressive Web App with a new take on the Note Taker app. It allows a user to add and delete text from their web browser or while offline via local download. The application uses the IndexedDB package to persistently store data in the browser. Click on the repository link below to find out more and try it now.", "prjPhoto": "./assets/Project6.jpg" , "prjUrl": "https://github.com/snovelli1021/TextEditor" }
]